node {
  name: "inputs/input_img"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 48
        }
        dim {
          size: 64
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "inputs/input_fp"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 48
        }
        dim {
          size: 64
        }
        dim {
          size: 12
        }
      }
    }
  }
}
node {
  name: "inputs/input_ang"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "inputs/phase_train"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\002\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5773502588272095
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5773502588272095
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/max"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/RandomUniform"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform"
  op: "Add"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/mul"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/Assign"
  op: "Assign"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/kernel/read"
  op: "Identity"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/bias/Assign"
  op: "Assign"
  input: "warping_model/encoder/dnn_blk_0/dnn/bias"
  input: "warping_model/encoder/dnn_blk_0/dnn/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/bias/read"
  op: "Identity"
  input: "warping_model/encoder/dnn_blk_0/dnn/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_0/dnn/bias"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/MatMul"
  op: "MatMul"
  input: "inputs/input_ang"
  input: "warping_model/encoder/dnn_blk_0/dnn/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/dnn/BiasAdd"
  op: "BiasAdd"
  input: "warping_model/encoder/dnn_blk_0/dnn/MatMul"
  input: "warping_model/encoder/dnn_blk_0/dnn/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_0/act"
  op: "Relu"
  input: "warping_model/encoder/dnn_blk_0/dnn/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.4330126941204071
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.4330126941204071
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/max"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/RandomUniform"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform"
  op: "Add"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/mul"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/Assign"
  op: "Assign"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/kernel/read"
  op: "Identity"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/bias/Assign"
  op: "Assign"
  input: "warping_model/encoder/dnn_blk_1/dnn/bias"
  input: "warping_model/encoder/dnn_blk_1/dnn/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/bias/read"
  op: "Identity"
  input: "warping_model/encoder/dnn_blk_1/dnn/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_1/dnn/bias"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/MatMul"
  op: "MatMul"
  input: "warping_model/encoder/dnn_blk_0/act"
  input: "warping_model/encoder/dnn_blk_1/dnn/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/dnn/BiasAdd"
  op: "BiasAdd"
  input: "warping_model/encoder/dnn_blk_1/dnn/MatMul"
  input: "warping_model/encoder/dnn_blk_1/dnn/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_1/act"
  op: "Relu"
  input: "warping_model/encoder/dnn_blk_1/dnn/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.4330126941204071
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.4330126941204071
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/max"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/RandomUniform"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform"
  op: "Add"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/mul"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/Assign"
  op: "Assign"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/kernel/read"
  op: "Identity"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/bias/Assign"
  op: "Assign"
  input: "warping_model/encoder/dnn_blk_2/dnn/bias"
  input: "warping_model/encoder/dnn_blk_2/dnn/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/bias/read"
  op: "Identity"
  input: "warping_model/encoder/dnn_blk_2/dnn/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/encoder/dnn_blk_2/dnn/bias"
      }
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/MatMul"
  op: "MatMul"
  input: "warping_model/encoder/dnn_blk_1/act"
  input: "warping_model/encoder/dnn_blk_2/dnn/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/dnn/BiasAdd"
  op: "BiasAdd"
  input: "warping_model/encoder/dnn_blk_2/dnn/MatMul"
  input: "warping_model/encoder/dnn_blk_2/dnn/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "warping_model/encoder/dnn_blk_2/act"
  op: "Relu"
  input: "warping_model/encoder/dnn_blk_2/dnn/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Shape"
  op: "Shape"
  input: "warping_model/encoder/dnn_blk_2/act"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/strided_slice"
  op: "StridedSlice"
  input: "warping_model/encoder/gen_agl_map/Shape"
  input: "warping_model/encoder/gen_agl_map/strided_slice/stack"
  input: "warping_model/encoder/gen_agl_map/strided_slice/stack_1"
  input: "warping_model/encoder/gen_agl_map/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\014\000\000"
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Tile"
  op: "Tile"
  input: "warping_model/encoder/dnn_blk_2/act"
  input: "warping_model/encoder/gen_agl_map/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Reshape/shape/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 48
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Reshape/shape/2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Reshape/shape/3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 16
      }
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Reshape/shape"
  op: "Pack"
  input: "warping_model/encoder/gen_agl_map/strided_slice"
  input: "warping_model/encoder/gen_agl_map/Reshape/shape/1"
  input: "warping_model/encoder/gen_agl_map/Reshape/shape/2"
  input: "warping_model/encoder/gen_agl_map/Reshape/shape/3"
  attr {
    key: "N"
    value {
      i: 4
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "warping_model/encoder/gen_agl_map/Reshape"
  op: "Reshape"
  input: "warping_model/encoder/gen_agl_map/Tile"
  input: "warping_model/encoder/gen_agl_map/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "warping_model/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "warping_model/concat"
  op: "ConcatV2"
  input: "inputs/input_img"
  input: "inputs/input_fp"
  input: "warping_model/encoder/gen_agl_map/Reshape"
  input: "warping_model/concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "warping_model/warping_module/average_pooling2d/AvgPool"
  op: "AvgPool"
  input: "warping_model/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\037\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.06172133982181549
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06172133982181549
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/max"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/RandomUniform"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform"
  op: "Add"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/mul"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 31
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Assign"
  op: "Assign"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/read"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/Conv2D"
  op: "Conv2D"
  input: "warping_model/warping_module/average_pooling2d/AvgPool"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/act"
  op: "Relu"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/cnn/Conv2D"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma/Assign"
  op: "Assign"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma/read"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta/Assign"
  op: "Assign"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta/read"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean/Assign"
  op: "Assign"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean/read"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_mean"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance/Assign"
  op: "Assign"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance/read"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/moving_variance"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Switch"
  op: "Switch"
  input: "inputs/phase_train"
  input: "inputs/phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/switch_t"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/switch_f"
  op: "Identity"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/pred_id"
  op: "Identity"
  input: "inputs/phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Const"
  op: "Const"
  input: "^warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Const_1"
  op: "Const"
  input: "^warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm/Switch:1"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm/Switch_1:1"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm/Switch_2:1"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Const"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/act"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/act"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma/read"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/gamma"
      }
    }
  }
}
node {
  name: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "warping_model/warping_module/coarse_level/cnn_blk_0/bn_layer/beta/read"
